<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<meta charset="UTF-8"> 
<h1 style="color: #5e9ca0;">Hogyan telep&iacute;tsd fel a repot?</h1>
<p>1 - Kodi -&gt; Rendszer -&gt; F&aacute;jlkezelő - &gt; Forr&aacute;s hozz&aacute;ad&aacute;sa -&gt; el&eacute;r&eacute;si &uacute;t: http://kizs.dyndns.org -&gt; m&eacute;diaforr&aacute;s neve p&eacute;ld&aacute;ul: KIZS Repo</p>
<p>2- Ezut&aacute;n Kodi -&gt; Rendszer -&gt; Be&aacute;ll&iacute;t&aacute;sok -&gt; Kieg&eacute;sz&iacute;tők -&gt; Telep&iacute;t&eacute;s zip f&aacute;jlb&oacute;l -&gt; KIZS Repo (vagy amit az előbb megadt&aacute;l) -&gt; kizsrepo.zip</p>
<h1 style="color: #5e9ca0;">Hogyan telep&iacute;tsd fel az Animeaddicts addont?</h1>
<p>1 - Tedd fel a KIZS Repo -t</p>
<p>2 - Kodi -&gt; Rendszer -&gt; Be&aacute;ll&iacute;t&aacute;sok -&gt; Kieg&eacute;sz&iacute;tők -&gt; Telep&iacute;t&eacute;s t&aacute;rol&oacute;b&oacute;l -&gt; KIZS Repo -&gt; Video kieg&eacute;sz&iacute;tők -&gt; Animeaddicts</p>
<h2 style="color: #5e9ca0;">Animeaddicts be&aacute;ll&iacute;t&aacute;sok:</h2>
<p>Felhaszn&aacute;l&oacute;n&eacute;v -&gt; a felhaszn&aacute;l&oacute;neved az animeaddicts.hu oldalon</p>
<p>Jelsz&oacute; -&gt; a jelszavad az animeaddicts.hu oldalon</p>
<p>Ideiglenes f&aacute;jlok helye -&gt; ide fog l&eacute;trehozni egy mini adatb&aacute;zist, ahol a filmek inform&aacute;ci&oacute;it t&aacute;rolja, ezt ne t&ouml;r&ouml;ld le lehetőleg!</p>
<p>Vide&oacute;lej&aacute;tsz&aacute;s minős&eacute;ge (SD, HD, FHD) -&gt; A k&eacute;rt minős&eacute;gű vide&oacute;t pr&oacute;b&aacute;lja lej&aacute;sztani. Ha nincs a filmhez az oldalon FHD lehetős&eacute;g, akkor automatikusan HD minős&eacute;get v&aacute;laszt</p>
<p>Lej&aacute;tsz&aacute;s előtt t&ouml;ltse le a filmet -&gt; ha kiv&aacute;lasztod, akkor let&ouml;lti a filmet, majd offline lej&aacute;tsza, k&uuml;l&ouml;nben stream-eli. Lass&uacute;, szakadoz&oacute; internet el&eacute;r&eacute;s eset&eacute;n hasznos.</p>
<h3 style="color: #5e9ca0;">J&oacute; tudni:</h3>
<p>Az első elindul&aacute;s t&ouml;bb percig is eltarthat, mert ekkor &eacute;p&iacute;ti fel a film adatb&aacute;zist.</p>
<p>Ha probl&eacute;m&aacute;d lenne (p&eacute;ld&aacute;ul nem friss&uuml;lnek a filmek vagy rosszul list&aacute;z), akkor l&eacute;pj ki az addonb&oacute;l, t&ouml;r&ouml;ld ki az ideiglenes k&ouml;nyvt&aacute;r tartalm&aacute;t &eacute;s l&eacute;pj vissza.</p>
<p>&nbsp;</p>
<h1 style="color: #5e9ca0;">Hogyan telep&iacute;tsd fel a BH/NCTV addont?</h1>
<p>1 - Tedd fel a KIZS Repo -t</p>
<p>2 - Kodi -&gt; Rendszer -&gt; Be&aacute;ll&iacute;t&aacute;sok -&gt; Kieg&eacute;sz&iacute;tők -&gt; Telep&iacute;t&eacute;s t&aacute;rol&oacute;b&oacute;l -&gt; KIZS Repo -&gt; Video kieg&eacute;sz&iacute;tők -&gt; BitHUmenTV / HUNCoreTV</p>
<h2 style="color: #5e9ca0;">Mi fog t&ouml;rt&eacute;nni?</h2>
<p>- Feltelepedik a <em>libtorrent</em> 1.0.7i verzi&oacute;ja</p>
<p>- Feltelepedik a <em>kizstorrent</em></p>
<p>- Feltelepedik a k&eacute;rt BHTV vagy NCTV addon</p>
<h2 style="color: #5e9ca0;">Mi a kizstorrent?</h2>
<p>Ez egy h&aacute;tt&eacute;rfolyamat, ami a torrent le &eacute;s visszat&ouml;lt&eacute;st v&eacute;gzi a libtorrent seg&iacute;ts&eacute;g&eacute;vel. A BHTV &eacute;s az NCTV is erre t&aacute;maszkodik.</p>
<p>Amikor a Kodi elindul akkor indul el ez is, &eacute;s eg&eacute;szen a Kodi le&aacute;ll&iacute;t&aacute;s&aacute;ig folyamatosan műk&ouml;dik. Megjegyzi a let&ouml;lteni k&iacute;v&aacute;nt dolgokat &eacute;s biztos&iacute;tja, hogy folyamatos legyen a let&ouml;lt&eacute;s/seed -el&eacute;s. Az sem baj, ha k&ouml;zben &uacute;jraind&iacute;tod a Kodi-t.</p>
<p>Ha letelt a be&aacute;ll&iacute;tott visszaoszt&aacute;si idő, akkor automatikusan t&ouml;rli az adott torenthez tartoz&oacute; &aacute;llom&aacute;nyokat.</p>
<p><strong>A visszaoszt&aacute;si idő a fizikailag eltelt napokkal sz&aacute;mol, nem a Kodi fut&aacute;si idej&eacute;vel! Teh&aacute;t ha 10 napot adt&aacute;l meg, de 9 &eacute;s f&eacute;l napig ki van kapcsolva a Kodi, akkor csak f&eacute;l nap visszat&ouml;lt&eacute;sed lesz!</strong></p>
<h2 style="color: #5e9ca0;">kizstorrent be&aacute;ll&iacute;t&aacute;sok:</h2>
<p>Telep&iacute;t&eacute;s ut&aacute;n r&ouml;gt&ouml;n pampogni fog, hogy nem v&eacute;gezted el a be&aacute;ll&iacute;t&aacute;sokat &eacute;s fel is fogja dobni a be&aacute;ll&iacute;t&aacute;sok k&eacute;pernyőt:</p>
<p>Let&ouml;lt&eacute;s ut&aacute;n visszaoszt&aacute;s -&gt; Ha kiv&aacute;lasztod, akkor vissza is oszt, egy&eacute;bk&eacute;nt csak let&ouml;lt</p>
<p>Ideiglenes f&aacute;jlok helye -&gt; saj&aacute;t kis adatb&aacute;zis&aacute;t fogja itt t&aacute;rolni, ebben lesz le&iacute;rva, hogy mikor mit kell let&ouml;ltenie, meddig ossza vissza stb.</p>
<p>Let&ouml;lt&ouml;tt filmek helye -&gt; ide fogja let&ouml;lteni a torrenteket, lehet ugyanaz mint az ideiglenes f&aacute;jlos k&ouml;nyvt&aacute;r</p>
<p>Sebess&eacute;g korl&aacute;toz&aacute;s -&gt; ha kiv&aacute;lasztod, akkor lehet fel/le t&ouml;lt&eacute;si korl&aacute;tokat mondani, k&uuml;l&ouml;nben unlimited minden. &Eacute;rdemes kiv&aacute;lasztani, k&uuml;l&ouml;nben nagyon leterhelheti a gyeng&eacute;bb rendszereket.</p>
<p>Let&ouml;lt&eacute;si korl&aacute;t (KB/s) -&gt; pont azt jelenti, mint ami oda van &iacute;rva</p>
<p>Felt&ouml;lt&eacute;si korl&aacute;t (KB/s) -&gt; pont azt jelenti, mint ami oda van &iacute;rva</p>
<p>Egyidejű kapcsolatok maxim&aacute;lis sz&aacute;ma torrentenk&eacute;nt -&gt; pont azt jelenti, mint ami oda van &iacute;rva</p>
<p><em>a kizstorrent be&aacute;ll&iacute;t&aacute;sai a BHTV &eacute;s NCTV főmen&uuml;j&eacute;ből is el&eacute;rhetők</em></p>
<p><strong>Első be&aacute;ll&iacute;t&aacute;s ut&aacute;n mindenk&eacute;pp ind&iacute;tsd &uacute;jra a teljes Kodi-t! Ha k&eacute;sőbb megv&aacute;ltoztatod az ideiglenes f&aacute;jlok hely&eacute;t, akkor is!</strong></p>
<p>&nbsp;</p>
<h2 style="color: #5e9ca0;">BH/NCTV be&aacute;ll&iacute;t&aacute;sok:</h2>
<p>Felhaszn&aacute;l&oacute;n&eacute;v -&gt; a felhaszn&aacute;l&oacute;neved az &eacute;rintett oldalon</p>
<p>Jelsz&oacute; -&gt; a jelszavad az &eacute;rintett oldalon</p>
<p>Ideiglenes f&aacute;jlok helye -&gt; ebben a k&ouml;nyvt&aacute;rban fogja t&aacute;rolni az ideiglenes f&aacute;jlokat (torrent f&aacute;jlok, bor&iacute;t&oacute;k k&eacute;pei). <strong>Adott idők&ouml;z&ouml;nk&eacute;nt kompletten t&ouml;rlődik a k&ouml;nyvt&aacute;r, sz&oacute;val m&aacute;sra ne haszn&aacute;ld!</strong></p>
<p>V&aacute;rja meg a let&ouml;lt&eacute;s v&eacute;g&eacute;t a lej&aacute;tsz&aacute;ssal -&gt; ha be&aacute;ll&iacute;tod, akkor let&ouml;lti a teljes torrentet &eacute;s ut&aacute;na ind&iacute;tja el a lej&aacute;tsz&aacute;st</p>
<p>Ennyi % előnyt adjon a lej&aacute;tsz&oacute; a let&ouml;ltőnek -&gt; ha nem a teljes let&ouml;lt&eacute;st v&aacute;laszottad, akkor a torrent ennyi %-&aacute;nak a let&ouml;lt&eacute;se ut&aacute;na <em>megpr&oacute;b&aacute;lja</em> lej&aacute;tszani a filmet</p>
<p>Ennyi napig őrizze meg az ideiglenes &aacute;llom&aacute;nyokat -&gt; pont azt jelenti, mint ami oda van &iacute;rva</p>
<p>Ennyi napig ossza vissza a torrentet -&gt; pont azt jelenti, mint ami oda van &iacute;rva</p>
<p>&nbsp;</p>
<p>A t&ouml;bbi be&aacute;ll&iacute;t&aacute;s szerintem el&eacute;g besz&eacute;des nevet kapott a kieg&eacute;sz&iacute;tőkben, ezeket nem r&eacute;szletezn&eacute;m.</p>
